{
  "A0007": {
    "title": "Multi-Factor Authentication",
    "definition": "Adding additional identity verification factors beyond the primary identification method (such as username and password).",
    "description": "Multi-Factor Authentication (MFA), sometimes also called two-factor authentication, has become the mainstream approach to identity verification. Its existence largely addresses the problem of identity impersonation and abuse caused by credential leaks. Common MFA factors include: SMS verification codes, email verification codes, Time-based One-Time Passwords (TOTP), etc.",
    "limitation": "Compared to traditional username/password login, MFA can significantly improve account security. However, attacks against MFA are also constantly emerging, such as Man-in-the-Middle (MitM) attacks, SIM swap attacks, Pass-The-Cookie attacks, MFA fatigue attacks, etc., which to some extent undermine the account security framework built by MFA.",
    "references": [
      {
        "title": "Multi-Factor Authentication - Baidu Baike",
        "link": "https://baike.baidu.com/item/%E5%A4%9A%E5%9B%A0%E7%B4%A0%E8%BA%AB%E4%BB%BD%E9%AA%8C%E8%AF%81/17580929?fr=ge_ala"
      }
    ]
  },
  "A0007-001": {
    "title": "SMS Verification",
    "definition": "Sending a verification code to the user's phone via SMS; the user enters the code to complete identity verification.",
    "description": "SMS verification codes are currently the most common form of multi-factor authentication. Their advantages include: 1. The user's phone number is unique and can serve as a unique identifier; 2. SMS verification codes are one-time use with a short validity period, effectively preventing identity impersonation and abuse from code leaks during the validity window; 3. SMS verification codes are a mandatory verification method that users cannot bypass.",
    "limitation": "Because SMS verification codes are sent to the user's phone via SMS, the code may be leaked during the sending process by the SMS service provider or during the phone's receipt process, leading to identity impersonation and abuse. Additionally, since SMS verification codes rely on phone numbers, and users may change their phone numbers, the new holder of a phone number may gain access to the previous holder's account. Furthermore, SMS verification codes are also subject to SMS bombing (R0029).",
    "references": [
      {
        "title": "SMS OTP (One-Time Password) Verification: Quick Start Guide",
        "link": "https://sakari.io/blog/what-is-sms-otp"
      }
    ]
  },
  "A0007-002": {
    "title": "Email Verification",
    "definition": "Sending a verification code to the user's email address; the user enters the code to complete identity verification.",
    "description": "Email verification codes are similar to SMS verification codes. Their advantages include: 1. The user's email address is unique and can serve as a unique identifier; 2. Email verification codes are one-time use with a short validity period, effectively preventing identity impersonation and abuse from code leaks during the validity window; 3. Email verification codes are a mandatory verification method that users cannot bypass.",
    "limitation": "Because registering an email address is relatively easy, using email verification codes to defend against bulk registration (R0030-001) is less effective. Additionally, many email services do not require multi-factor authentication for login, meaning that even if email verification codes are used, identity impersonation and abuse cannot be prevented if the user's credentials are leaked.",
    "references": [
      {
        "title": "Multi-Factor Authentication - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Multi-factor_authentication"
      }
    ]
  },
  "A0007-003": {
    "title": "One-Time Password",
    "definition": "A time-based one-time password generated by the TOTP algorithm; the user enters the password to complete identity verification.",
    "description": "TOTP is a time-based one-time password. Its advantages include: 1. TOTP is one-time use with a short validity period, effectively preventing identity impersonation and abuse from password leaks during the validity window; 2. TOTP is a mandatory verification method that users cannot bypass.",
    "limitation": "Because TOTP is generated by the TOTP algorithm which is time-based, the security of TOTP depends on time synchronization. If the server time and the user's terminal time are out of sync, the TOTP-generated password will be incorrect.",
    "references": [
      {
        "title": "OTP & TOTP Simple Introduction",
        "link": "https://zhuanlan.zhihu.com/p/484991482"
      }
    ]
  },
  "A0007-004": {
    "title": "Phone Voice Verification",
    "definition": "A human verification technology conducted via phone call. After receiving the call, the user must complete a verification challenge, typically by responding to a system-generated voice prompt or performing a related operation. This verification method is commonly used for account identity verification, password resets, and other sensitive operations to improve security.",
    "description": "Methods include: digit string verification — after the user answers the call, the system plays a voice string containing numbers, and the user must listen and enter the correct digit string to complete verification. Voice commands — the user may be asked to follow voice prompts to perform certain instructions, such as saying specific words, numbers, or performing an action. Speech recognition technology — the voice verification system may use speech recognition to confirm whether the user's response is correct.",
    "limitation": "The limitations of phone voice verification codes include sensitivity to voice quality, differences in user comprehension, confidentiality concerns, unfriendliness to users with disabilities, and potential risks of abuse.",
    "references": [
      {
        "title": "IVR vs. Agents: Your Guide to Customer Authentication",
        "link": "https://www.pindrop.com/blog/customer-authentication-guide"
      }
    ]
  }
}
