{
  "A0013": {
    "title": "Client Application Hardening",
    "definition": "Applying code-level obfuscation, anti-debugging, and other protections to front-end JS scripts or client APPs.",
    "description": "Client-side code obfuscation can, to some extent, prevent black-gray industry actors from directly reverse-engineering client-side code to analyze resource access logic and implement business automation and data scraping. It also increases the difficulty of breaking client-side human verification challenges, abnormal environment detection (A010), API signatures (A002), and other business security measures. However, because the obfuscated code still resides on the user's client, it is theoretically possible to fully reverse the obfuscated code given sufficient time and effort. Therefore, client-side code obfuscation is only a means of reducing the ROI of black-gray industry actors. However, according to the PDR formula Pt > Dt + Rt, if defenders can reduce the obfuscation cycle to within the cracking cycle, long-term protection may be achievable. Anti-debugging can be either a blocking mechanism against debugging or an interference mechanism — for example, one program logic can run in a non-debug environment and a different logic in a debug environment.",
    "limitation": "Hardened applications can still be decompiled: although hardening increases the difficulty of decompilation, it cannot completely prevent it. Hackers can use various means to crack hardened applications and obtain source code and sensitive information. Hardened applications may have compatibility issues: since hardening modifies the application's code and structure, it may cause compatibility problems — for example, the hardened application may not run on certain devices or may crash. Hardened applications may have performance issues: since hardening increases the application's size and runtime overhead, it may cause performance problems such as slower startup or higher memory usage.",
    "references": [
      {
        "title": "Code Obfuscation - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Code_obfuscation"
      }
    ]
  },
  "A0013-001": {
    "title": "Android Application Hardening",
    "definition": "Hardening Android applications through anti-reverse engineering, anti-tampering, anti-debugging, and anti-malware measures.",
    "description": "Multiple DEX protection modes combined with VMP virtual machines encrypt and protect critical code and core logic, preventing source code extraction via reverse engineering tools such as IDA, JEB, JADX, APKTool, and Readelf. Each file in the app is assigned a unique fingerprint; combined with signature and file integrity verification, replacing any file will prevent the app from running, guarding against ad virus injection, repackaging, and feature blocking. Multi-layer encryption combined with low-level countermeasures prevents code injection and Java/C-layer dynamic debugging, effectively resisting dynamic debugging, memory dumping, code injection, and HOOK attacks. Effectively detects and counters: ROOT, emulators, UI hijacking, multi-instance tools, Xposed plugins, Frida, and other HOOK tools. (Excerpted from dun.163.com)",
    "limitation": "May have compatibility and runtime performance issues.",
    "references": [
      {
        "title": "OWASP Mobile Application Security",
        "link": "https://mas.owasp.org/"
      }
    ]
  },
  "A0013-002": {
    "title": "iOS Application Hardening",
    "definition": "Hardening iOS applications through anti-reverse engineering, anti-tampering, anti-debugging, and anti-malware measures.",
    "description": "Encrypts strings to prevent keyword-based location of core business code via tools like IDA. Applies multiple obfuscation methods to application code to increase complexity and reverse analysis difficulty without affecting original logic and performance. Obfuscates application symbols to increase code reverse difficulty. Advanced anti-debugging techniques prevent attackers and malicious analysts from dynamically debugging the program. Protects binary code from being decompiled into pseudo-code by reverse analysis tools. Protects numerical values in the application from being tampered with by memory editors (e.g., attack power, HP in games). Applies integrity protection to prevent tampering, repackaging, and other cheating behaviors. (Excerpted from dun.163.com)",
    "limitation": "May have compatibility and runtime performance issues.",
    "references": [
      {
        "title": "OWASP Mobile Application Security",
        "link": "https://mas.owasp.org/"
      }
    ]
  },
  "A0013-003": {
    "title": "H5/Mini-Program Hardening",
    "definition": "Hardening H5 applications through anti-reverse engineering, anti-tampering, anti-debugging, and anti-malware measures.",
    "description": "Uses encryption technology to counter dynamic debugging and prevent code from being debugged and cracked or data from being extracted. Supports strong binding of H5 applications to specified domains, preventing domain tampering that could redirect users or enable fraud. Encrypts code and script files, including dynamic encryption/decryption of strings, function names, and expressions, and obfuscates variables to increase cracking difficulty. Also supports code file compression to reduce application size. Uses encryption technology to protect data and prevent sensitive data from being obtained through network packet capture. (Excerpted from dun.163.com)",
    "limitation": "May have compatibility and runtime performance issues.",
    "references": [
      {
        "title": "OWASP Bytecode Obfuscation",
        "link": "https://owasp.org/www-community/controls/Bytecode_obfuscation"
      }
    ]
  },
  "A0013-004": {
    "title": "Desktop Application Hardening",
    "definition": "Hardening desktop applications through anti-reverse engineering, anti-tampering, anti-debugging, and anti-malware measures.",
    "description": "Encrypts and protects the application to prevent decompilation. Applies obfuscation to increase code complexity and reverse analysis difficulty without affecting original logic and performance. Obfuscates application symbols to increase code reverse difficulty. Advanced anti-debugging techniques prevent attackers and malicious analysts from dynamically debugging the program. Protects binary code from being decompiled into pseudo-code by reverse analysis tools. Protects numerical values in the application from being tampered with by memory editors (e.g., attack power, HP in games). Applies integrity protection to prevent tampering, repackaging, and other cheating behaviors.",
    "limitation": "May have compatibility and runtime performance issues.",
    "references": [
      {
        "title": "OWASP Bytecode Obfuscation",
        "link": "https://owasp.org/www-community/controls/Bytecode_obfuscation"
      }
    ]
  }
}
