{
  "A0018": {
    "title": "Identity Authentication (Login)",
    "definition": "Requiring users to confirm their identity through login or similar means when requesting related resources from a terminal.",
    "description": "In most cases, identity authentication takes the form of login. Without verifying login status, it is very difficult to continuously monitor terminal access behavior, because both request characteristics and request sources are trivially easy to forge. This makes evading server-side continuous monitoring of terminal access a common method for avoiding penalties for resource abuse. For this reason, many businesses now use identity authentication as an effective means of achieving continuous monitoring of terminal access behavior. Without authentication, terminals can only access a limited type or quantity of resources; to access more resources, identity authentication is required.",
    "limitation": "The protective effectiveness of identity authentication is heavily dependent on the cost of obtaining a business identity — both the registration cost and the login authentication cost — and is also closely related to the severity of account penalties (A020). Some websites allow arbitrary bulk registration of user identities, in which case the value of identity authentication is very limited.",
    "references": [
      {
        "title": "Authentication - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Authentication"
      }
    ]
  },
  "A0018-001": {
    "title": "Zero-Knowledge Proof",
    "definition": "A special interactive protocol that allows a prover to prove to a verifier that a statement is true without providing any information about the statement to the verifier.",
    "description": "The basic idea of zero-knowledge proof is that the prover, through a series of interactions, proves to the verifier that they know the evidence for a statement, but in this process the prover does not reveal any information about the evidence. A typical application scenario is identity authentication: the prover can prove to the verifier that they know a certain password without revealing any information about the password. For example, in an e-commerce scenario, when a user's identity is in doubt, the user can confirm their identity by selecting products they have previously purchased. Or in a social scenario, the user can confirm their identity by selecting their own friends.",
    "limitation": "Users may lose access to certain knowledge, making it impossible to pass verification.",
    "references": [
      {
        "title": "Zero-Knowledge Proof",
        "link": "https://zhuanlan.zhihu.com/p/634225678"
      }
    ]
  },
  "A0019-002": {
    "title": "Invitation Code Mechanism",
    "definition": "A mechanism that restricts user registration through invitation codes.",
    "description": "When registering, users must enter an invitation code to complete registration. Invitation codes can be generated by administrators or by other users. The invitation code mechanism can effectively prevent malicious registration, but requires administrators or other users to generate invitation codes, so the cost is relatively high.",
    "limitation": "The invitation code mechanism increases the cost of user registration and is therefore not suitable for scenarios with a large volume of user registrations.",
    "references": []
  },
  "A0019-003": {
    "title": "Friend-Assisted Authentication",
    "definition": "A mechanism that uses the user's friends to assist in authenticating the user's identity.",
    "description": "When registering or authenticating, users must select their friends, and the system sends verification information to those friends. The user must pass verification by those friends to complete registration.",
    "limitation": "If the user has no friends, or if friends are unwilling to help with verification, the user will be unable to complete registration.",
    "references": []
  }
}
