{
  "A0020": {
    "title": "Account Penalty",
    "definition": "Penalizing accounts when they violate related rules, and prohibiting related behaviors or actions.",
    "description": "Identity penalty strategies are an effective means of limiting the continuous damage caused by illegal or non-compliant users to the business. Identity penalties can operate at two levels: one is restrictions on the account itself, such as temporary suspension, public warning, or revocation of authorization; the other is restrictions on the resources accessible to the account, such as disabling specific business functions, limiting resource usage frequency, deleting resources, or restricting access to illegal resources.",
    "limitation": "Account penalties are a loss-mitigation strategy with a certain degree of latency.",
    "references": []
  },
  "A0020-001": {
    "title": "Store Penalty",
    "definition": "Penalizing a store when it violates related rules, and prohibiting related behaviors or actions.",
    "description": "Store penalty strategies include: lowering credit ratings, lowering tier levels, taking down products, reducing search ranking weight, suspending the store, banning the store, fines, etc.",
    "limitation": "Store penalties are a loss-mitigation strategy with a certain degree of latency.",
    "references": []
  },
  "A0020-002": {
    "title": "Employee Penalty",
    "definition": "Employee penalty strategies are a set of sanctions established by an organization in response to employees violating company rules or policies.",
    "description": "Penalty content may include verbal warnings, written warnings, suspension, demotion, salary deductions, termination, etc. Effective employee penalty strategies should balance punishment and improvement, making employees aware of the consequences of misconduct while providing opportunities for correction and improvement.",
    "limitation": "Limitations include the potential to cause employee dissatisfaction and affect the work environment. Compliance must be ensured to guard against legal action. Therefore, fair, clear, and consistently enforced strategies must be developed in alignment with relevant regulations and company policies.",
    "references": [
      { "title": "Which Employee Behaviors Require Penalties" }
    ]
  },
  "A0020-003": {
    "title": "Account Ban",
    "definition": "Banning an account when it violates related rules, preventing the account from logging in.",
    "description": "Account ban strategies include: account ban, account freeze, account deactivation, account deletion, etc.",
    "limitation": "Account banning is a loss-mitigation strategy with a certain degree of latency.",
    "references": []
  }
}
