{
  "A0078": {
    "title": "Endpoint Detection and Response",
    "definition": "Endpoint Detection and Response (EDR) is a security technology that performs continuous monitoring, threat detection, event recording, and automated response at the endpoint device level, capable of real-time discovery and handling of malicious activity on endpoints.",
    "description": "Endpoint Detection and Response (EDR) is an endpoint security technology that deploys lightweight agent programs on user devices to achieve continuous monitoring and threat response. Main capabilities include: (1) process behavior monitoring — monitoring the creation, execution, and communication behavior of all processes on endpoints to identify threats such as malware, information stealers, and keyloggers; (2) file integrity monitoring — detecting anomalous modifications, additions, and deletions of critical system and application files; (3) network behavior analysis — monitoring endpoint network connections, DNS requests, data transfers, and other behaviors to identify anomalous external connections and data exfiltration; (4) memory analysis — scanning endpoint memory to detect fileless attacks and memory injection and other advanced threats; (5) automated response — automatically executing process isolation, network blocking, file quarantine, and other response actions upon threat detection; (6) threat hunting — supporting security analysts in proactively searching for potential threat indicators (IOCs) on endpoints; (7) incident tracing — recording complete endpoint behavior logs to support post-incident investigation and attack chain reconstruction.",
    "limitation": "The limitations of EDR include: (1) some performance impact on endpoints, potentially causing devices to run slower; (2) advanced attackers may bypass EDR detection through kernel-level rootkits or firmware attacks; (3) deployment and management is difficult in BYOD (bring your own device) scenarios; (4) large volumes of alerts generated by many endpoints require professional security teams for analysis and handling; (5) detection capability for encrypted communications and zero-day attacks is limited.",
    "references": [
      { "title": "Endpoint Detection and Response - Gartner" },
      { "title": "EDR Technology Development and Practice - CNCERT" }
    ]
  }
}
