{
  "A0075": {
    "title": "Graph Computing / Association Analysis",
    "definition": "Using graph databases and graph computing technologies to analyze the relationships between entities such as accounts, devices, IPs, and phone numbers, identifying organized fraud behavior and anomalous association patterns.",
    "description": "Graph computing and association analysis is a risk control analysis method based on graph theory that identifies fraud groups and anomalous behavior patterns by constructing entity relationship graphs. Main capabilities include: (1) association graph construction — using accounts, device fingerprints, IP addresses, phone numbers, shipping addresses, bank cards, and other entities as graph nodes, with the relationships between them as edges, to build a multi-dimensional association graph; (2) community detection — using community detection algorithms such as Louvain and Label Propagation to identify tightly connected node clusters and discover potential fraud groups; (3) anomaly propagation analysis — when a node is flagged as malicious, using graph propagation algorithms to assess the risk level of other nodes associated with it; (4) cycle detection — identifying cyclic structures in fund transfers and account associations to detect anomalous transaction patterns such as money laundering and self-dealing; (5) centrality analysis — calculating node degree centrality, betweenness centrality, and other metrics to identify core nodes and key intermediaries within a group; (6) temporal graph analysis — combining the time dimension to analyze dynamic changes in association relationships and identify abnormal association clusters that appear suddenly within a short time.",
    "limitation": "The limitations of graph computing and association analysis include: (1) large-scale graph computation requires significant computational and storage resources, limiting real-time performance; (2) the quality of association relationship data directly affects analysis results, and missing or erroneous data can lead to misjudgments; (3) attackers can sever association links by isolating devices and using independent IPs; (4) normal users may also have legitimate association relationships (such as family members sharing a device), requiring fine-grained rules to avoid false positives; (5) graph models have relatively poor explainability, making it difficult for business personnel to understand and tune them.",
    "references": [
      { "title": "Graph Computing in Financial Risk Control Practice" },
      { "title": "Graph-Based Fraud Detection - ACM" }
    ]
  }
}
