{
  "A0079": {
    "title": "Privileged Access Management",
    "definition": "Privileged Access Management (PAM) is a security mechanism for centralized control of accounts with elevated permissions, including access control, session recording, password vaulting, and approval management, to prevent privileged accounts from being abused or stolen.",
    "description": "Privileged Access Management (PAM) is a security control system for high-privilege accounts designed to prevent privileged accounts from being abused by insiders or stolen and exploited by external attackers. Main capabilities include: (1) privileged account discovery and onboarding — automatically discovering privileged accounts in the IT environment (such as root, admin, DBA) and bringing them under unified management; (2) password vault — centrally storing and managing privileged account passwords with automatic password rotation to avoid plaintext password exposure and long-term unchanged passwords; (3) least privilege principle — assigning the minimum necessary permissions based on work needs and limiting the scope and duration of privileged account use; (4) just-in-time (JIT) privilege elevation — granting privileges temporarily on demand and automatically revoking them after use to reduce the exposure window of privileged accounts; (5) session monitoring and recording — performing real-time monitoring and recording of privileged account operation sessions to support post-incident auditing and playback; (6) multi-level approval — requiring multi-level approval for high-risk operations to prevent single-person unauthorized actions; (7) anomalous behavior detection — monitoring privileged account usage behavior to detect suspicious activities such as anomalous login times and anomalous operation commands.",
    "limitation": "The limitations of privileged access management include: (1) high deployment and integration complexity requiring deep integration with existing IT systems; (2) overly strict controls may affect operational efficiency, requiring a balance between security and efficiency; (3) privileged management in cloud-native environments faces new challenges such as temporary credentials and service accounts; (4) cannot completely prevent deliberate sabotage by insiders who have already obtained privileges; (5) password rotation may cause automated processes that depend on those passwords to break.",
    "references": [
      { "title": "Privileged Access Management - NIST" },
      { "title": "Privileged Access Management Best Practices - CyberArk" }
    ]
  }
}
