{
  "A0001": {
    "title": "人机验证技术",
    "category": "AC01",
    "definition": "也称CAPTCHA或验证码机制，通过设置挑战实现对人类操作和非人类操作区分。",
    "description": "一般通过行为验证码、图文验证码等方式设置人机挑战，或通过收集鼠标移动轨迹、点击事件、屏幕点按压力、滑动轨迹、请求访问速率、3D陀螺仪等数据并分析的方式进行人机识别。注：人脸识别通常被认为是生物特征识别（A023）的一种。",
    "limitation": "目前黑灰产催生出“打码平台”（AT0008），通过众包服务人工打码模式来完成突破人机识别挑战。对于人机识别挑战基本是降维打击，从理论上讲可导致所有显式的人机识别彻底失效。",
    "references": [
      {
        "title": "Captcha - 百度百科",
        "link": "https://baike.baidu.com/item/Captcha/9630117?fr=aladdin"
      }
    ],
    "updated": "2024-01-11"
  },
  "A0001-001": {
    "title": "图文式人机验证",
    "category": "AC01",
    "definition": "通过让挑战者识别图片中的内容并填写到输入框中完成验证的一种人机挑战",
    "description": "图片验证码，也被称为图形验证码，是一种常见的用户身份验证方法。它通常由一组随机生成的数字、字母或符号组成，这些字符以图形的形式展示，通常会加入一些干扰元素，如线条、噪点或扭曲，以防止自动化工具（例如机器人或OCR软件）轻易识别。用户需要正确输入图片中显示的字符才能通过验证。这种方法主要用于防止恶意软件或非人类用户进行自动化操作。挑战点主要依赖于人类对不规则图文的识别能力与计算机识别能力差距。",
    "limitation": "随着计算机计算能力的提升以及AI图片识别能力的增强，这种验证码被破解的概率越来越高。尤其是AI生成内容的发展，使得传统的图片验证码机制近乎失效。图片验证码的一个主流的进化方向是与行为验证码（A001-002）相结合，通过多维度的因素来完成人机识别挑战。",
    "references": [
      {
        "title": "GITHUB上的Captcha开源库",
        "link": "https://github.com/search?q=captcha"
      }
    ],
    "updated": "2024-01-11"
  },
  "A0001-002": {
    "title": "行为式人机验证",
    "category": "AC01",
    "definition": "一种结合图文识别与人类鼠标键盘、屏幕操作相结合的人机挑战模式",
    "description": "目前常见的行为式验证码通常建立在人类识别图文信息基础上的点击、选择、滑动、拖动等动作，通过对比人类的行为与机器行为的差异来进行人机判断。因为除了图片识别外，还增加了行为鉴别，所以抗破解性会高于传统的图片验证码（A001-001）",
    "limitation": "行为验证码的原理是在人类识别图文信息的基础上，依照对图文的理解去进行一定的键鼠动作。从图片验证码（A001-001）的局限性可见：图文信息的挑战越来越难以区分人机界限，行为验证码同样面临这样的问题。行为验证通过对人类的键鼠动作进行深度学习形成模型以识别机器自动化键鼠的平滑操作。但机器自动化同样可以通过对人类键鼠动作的深度学习来达到以假乱真的地步，会是未来面临的巨大挑战。",
    "references": [
      {
        "title": "AJ-Captcha(行为验证码，包含滑动拼图、文字点选两种方式)",
        "link": "https://gitee.com/anji-plus/captcha"
      }
    ],
    "updated": "2024-01-11"
  },
  "A0001-003": {
    "title": "语音人机验证",
    "category": "AC01",
    "definition": "语音验证码是一种人机验证技术，与图形验证码类似，但是通过声音进行验证。用户需要听取系统生成的语音内容，然后回答或执行相关操作，以证明其为真实的人类用户。语音验证码通常用于手机验证、语音导航系统和其他需要语音交互的场景。",
    "description": "手段方法包括：数字串验证： 系统会生成包含数字的语音串，用户需要听取并输入正确的数字串以完成验证。语音指令： 用户可能被要求按照语音提示执行某些指令，例如说出特定的单词、数字或执行某项操作。语音识别技术： 语音验证码系统可能使用语音识别技术来确认用户的回答是否正确。",
    "limitation": "语音验证码的局限性包括对语音质量、用户理解差异、嘈杂环境的敏感性，以及对残障用户不友好，同时可能增加计算资源的需求。",
    "references": [],
    "updated": "2024-01-16"
  },
  "A0001-004": {
    "title": "静默人机验证",
    "category": "AC01",
    "definition": "静默人机验证是一种人机验证技术，通过分析用户的行为特征，判断用户是否为真实的人类用户。静默人机验证不需要用户进行任何额外的操作，用户无需主动输入任何信息，也无需进行任何额外的操作，即可完成验证。",
    "description": "静默人机验证的手段方法包括：用户行为分析： 通过分析用户的行为特征，例如鼠标移动轨迹、点击事件、屏幕点按压力、滑动轨迹、请求访问速率、3D陀螺仪等数据，来判断用户是否为真实的人类用户。用户环境分析： 通过分析用户的环境特征，例如用户的IP地址、设备信息、浏览器信息、操作系统信息、地理位置等数据，来判断用户是否为真实的人类用户。用户行为与环境分析： 通过分析用户的行为特征和环境特征，来判断用户是否为真实的人类用户。",
    "limitation": "静默人机验证的局限性包括对用户环境的敏感性，以及对残障用户不友好。",
    "references": [],
    "updated": "2024-01-25"
  }
}