{
  "A0013": {
    "title": "终端应用加固",
    "category": "AC01",
    "definition": "对前端JS脚本或客户端APP进行代码级别混淆、增加反调试等功能。",
    "description": "访问端代码混淆一方面可以在一定程度上解决黑灰产直接逆向访问端代码，分析资源访问逻辑，实现业务自动化及数据爬取问题；另一方面也能增加破解终端人机挑战、异常环境检测（A010）、接口签名（A002）等业务安全防护手段的难度。不过因为混淆后的代码依旧在用户访问端，所以在不考虑时间成本和人力成本的前提下，混淆代码最终还是具备被完全还原的可行性。所以访问端代码混淆仅是一种降低黑灰产ROI的手段。不过若按照PDR中的Pt>Dt+Rt公式来看，如果防守者有能力将代码混淆的周期降低到破解周期内，则有可能达到长期防护的效果。反调试既可以是一种针对调试的阻断，也可以是一种针对调试的干扰，譬如可以实现非调试环境下是一种程序运行逻辑，调试环境下是另外一种程序运行逻辑。",
    "limitation": "加固后的应用仍然可以被反编译：虽然应用加固可以增加反编译的难度，但是并不能完全防止应用被反编译。黑客可以通过各种手段来破解加固后的应用，从而获取应用的源代码和敏感信息。加固后的应用可能存在兼容性问题：由于加固会修改应用的代码和结构，因此可能会导致应用出现兼容性问题。例如，加固后的应用可能无法在某些设备上运行或者出现崩溃等问题。加固后的应用可能存在性能问题：由于加固会增加应用的体积和运行时开销，因此可能会导致应用出现性能问题。例如，加固后的应用可能启动较慢或者占用较多内存等问题。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0013-001": {
    "title": "Android应用加固",
    "category": "AC01",
    "definition": "通过防逆向、防篡改、防调试、防恶意软件等方式来加固Android应用程序",
    "description": "对DEX的多种保护模式结合VMP虚拟机，对关键代码、核心逻辑进行加密保护，避免通过IDA、JEB、JADX、APKTool、Readelf等逆向工具分析获取源码；对App应用每个文件分配唯一识别指纹，结合签名及文件的完整性校验，替换任何一个文件会导致无法运行，防止广告病毒植入、二次打包、功能屏蔽等恶意破解；多重加密技术结合底层对抗技术防止代码注入，防止Java层/C层动态调试，可有效抵挡动态调试、内存DUMP、代码注入、HOOK等恶意攻击；有效检测并对抗：ROOT、模拟器、界面劫持、多开器、Xposed插件、frida等各种HOOK工具（摘自dun.163.com）",
    "limitation": "可能会有兼容性问题及运行性能问题",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0013-002": {
    "title": "iOS应用加固",
    "category": "AC01",
    "definition": "通过防逆向、防篡改、防调试、防恶意软件等方式来加固iOS应用程序",
    "description": "对字符串进行加密保护，防止通过IDA等工具获取关键词定位核心业务代码；对应用代码进行多种方式混淆处理，提高代码的复杂度和逆向分析难度但不影响原始逻辑和性能；对应用的符号进行混淆,增加代码逆向难度；高级的反调试技术，防止攻击者、恶意分析者动态调试分析程序；对应用的二进制代码进行保护，防止逆向分析工具将代码反编译为伪代码（Pseudo-Code）；对应用中的数值进行保护，防止修改器对数值进行篡改，比如游戏中的攻击力、血量等值；对应用进行完整性保护，防止破解者对应用的篡改、重打包等作弊行为（摘自dun.163.com）",
    "limitation": "可能会有兼容性问题及运行性能问题",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0013-003": {
    "title": "H5小程序加固",
    "category": "AC01",
    "definition": "通过防逆向、防篡改、防调试、防恶意软件等方式来加固H5应用程序",
    "description": "利用加密技术对抗动态调试，防止代码被调试破解、数据被套取；支持H5应用强绑定指定域名，防止应用域名被篡改，导致用户被导流甚至被欺诈；对代码、脚本文件进行加密，包括动态加解密字符串、函数名、表达式等，对变量进行混淆，提高破解难度。同时支持代码文件压缩，减少应用体积；利用加密技术对数据进行保护，防止网络抓包分析获取敏感数据（摘自dun.163.com）",
    "limitation": "可能会有兼容性问题及运行性能问题",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0013-004": {
    "title": "桌面应用加固",
    "category": "AC01",
    "definition": "通过防逆向、防篡改、防调试、防恶意软件等方式来加固桌面应用程序",
    "description": "对应用程序进行加密保护，防止应用被反编译；对应用程序进行混淆处理，提高代码的复杂度和逆向分析难度但不影响原始逻辑和性能；对应用的符号进行混淆,增加代码逆向难度；高级的反调试技术，防止攻击者、恶意分析者动态调试分析程序；对应用的二进制代码进行保护，防止逆向分析工具将代码反编译为伪代码（Pseudo-Code）；对应用中的数值进行保护，防止修改器对数值进行篡改，比如游戏中的攻击力、血量等值；对应用进行完整性保护，防止破解者对应用的篡改、重打包等作弊行为",
    "limitation": "可能会有兼容性问题及运行性能问题",
    "references": [],
    "updated": "2024-01-11"
  }
}