{
  "A0016": {
    "title": "威胁情报",
    "category": "AC03",
    "definition": "通过黑IP库、黑手机号库等威胁情报对黑产身份进行标记。",
    "description": "也经常被简写为TI或CTI。威胁情报的定义可以很广义：所有可以标识好与坏的数据标签都属于威胁情报。威胁情报比较考验情报运营能力以及情报质量，需要长期并实时保持数据的鲜活性。一般会把准召率作为威胁情报好坏的度量标准，好的威胁情报可以直接作为一种防护手段使用，而质量差的威胁情报则需要结合风控策略（A015）来使用，避免覆盖不全或大规模误报。",
    "limitation": "威胁情报的局限性主要包括信息来源的不完整性、时效性的挑战、过多的虚假信息、难以分辨针对性攻击、难以量化真实影响、跨组织共享合作的困难以及对隐私和法规的合规性问题。",
    "references": [
      {
        "title": "威胁情报 - 百度百科",
        "link": "https://baike.baidu.com/item/%E5%A8%81%E8%83%81%E6%83%85%E6%8A%A5/23311172?fr=ge_ala"
      }
    ],
    "updated": "2024-01-11"
  },
  "A0016-001": {
    "title": "IP情报",
    "category": "AC03",
    "definition": "对IP的风险系数、类型等进行标识",
    "description": "IP情报是指关于IP地址的各种信息，狭义的IP情报可能只包含IP的风险系数，广义的IP情报还包含：地理位置、ISP（互联网服务提供商）信息、ASN（自治系统号）、恶意活动历史、使用者、代理检测、网络流量分析等。",
    "limitation": "IP威胁情报的局限性在于：它只能提供有限的信息，无法提供完整的威胁情况。此外，由于网络攻击者不断变换攻击方式和手段，IP情报的有效性也会受到影响。因此，在使用IP情报时，需要结合其他安全技术和手段，以提高网络安全防护的效果。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0016-002": {
    "title": "域名&链接威胁情报",
    "category": "AC03",
    "definition": "对恶意域名或链接进行标识",
    "description": "与IP情报（A016-001）相比，域名&链接情报的准确性和有效性都较高，但使用场景受限：IP情报基本可以适用于任何网络请求的场景，而域名&链接情报通常只适用于恶意链接识别（A006-005）场景",
    "limitation": "针对域名的威胁情报存在范围太广的问题，导致针对域名进行封禁容易出现误拦截；而针对链接的情报又存在范围太小的问题，导致修改一下链接描述符就能绕过检测。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0016-003": {
    "title": "手机号情报",
    "category": "AC03",
    "definition": "对黑产手机号、二次号等进行标识",
    "description": "黑产手机号大都从风控系统、风险设备识别对抗等维度产生；而二次号通常来源于运营商，通过对接运营商接口，业务可以及时获得手机号的在用和二次身份绑定状态等。",
    "limitation": "黑产分子可以通过租用真人手机号的方式来获取号源，此外拦截卡（真人手机植入木马拦截短信）在黑产市场的占有率也颇高，成为当前最主流的恶意黑手机号。这些手机号虽然被用来开展黑灰产工作，但是却不能作为黑手机号进行直接拦截。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0016-004": {
    "title": "IOC妥协指标情报",
    "category": "AC03",
    "definition": "IOC（Indicator of Compromise）妥协指标情报是指用于检测和确认计算机系统或网络是否受到威胁或遭到侵害的特定标志和特征。这些标志可以包括特定的文件哈希、IP地址、域名、恶意文件的行为模式等。",
    "description": "内容可能包括：文件哈希值： 恶意文件的唯一标识符，可用于识别已知的恶意软件。IP地址： 已知与恶意活动相关的恶意IP地址。域名： 与威胁相关的可能恶意的域名。恶意文件的行为模式： 特定的恶意软件可能具有独特的行为模式，可作为威胁指标。",
    "limitation": "IOC妥协指标情报的局限性包括对已知攻击模式的依赖，易受攻击者变更IOC的影响，容易产生误报和漏报，以及其基于静态特征的特性，使其难以适应动态和变化的威胁环境。",
    "references": [
      {
        "title": "威胁情报基本术语",
        "link": "https://www.jianshu.com/p/201d296636f4"
      }
    ],
    "updated": "2024-01-11"
  },
  "A0016-005": {
    "title": "风险地址情报",
    "category": "AC03",
    "definition": "对用户填入的虚假或恶意的收货、通联地址进行标识",
    "description": "这类情报系统通常结合数据分析、机器学习和人工智能技术，从大量数据源中提取模式、行为和特征，以便识别潜在的风险地址。以下是风险地址情报的一些关键方面：虚假身份和欺诈检测： 风险地址情报系统可以分析用户填写的地址信息，与其他数据点（如姓名、联系方式等）进行比对，识别是否存在虚假身份或欺诈行为。历史行为分析： 通过分析用户过去的行为模式，系统可以识别异常或不寻常的地址填写行为。例如，频繁更改地址、使用相似的虚假地址等可能被认为是风险信号。地理信息验证： 利用地理信息系统（GIS）和地理位置数据，系统可以验证用户提供的地址是否与实际地理位置相符，从而排除或标识潜在的风险。社交网络分析： 将用户的地址信息与其在社交网络上的活动和关系联系起来，有助于检测潜在的欺诈或非法活动。黑名单匹配： 风险地址情报系统可以与已知的欺诈、恶意活动相关的地址黑名单进行匹配，及时发现并防范可能的风险。",
    "limitation": "局限性包括可能存在虚假信息逃避检测、误报率高、数据质量依赖性强、涉及隐私问题、受制于地理多样性、适应性不足于新型欺诈形式、可能影响用户体验，以及实施和维护成本较高。",
    "references": [],
    "updated": "2024-01-25"
  }
}