{
  "A0025": {
    "title": "数字证书",
    "category": "AC01",
    "definition": "通过数字证书机制对数据或文件进行数字签名和加密",
    "description": "与接口签名（A002）不同，数字证书更多强调数据或文件从发送端传递到接收端的整个传输链路的完整性，也可以作为对发送者的真实性验证机制。而接口签名更多地是保证用户端传递数据以及跨站点传递数据的完整性。简单来说，数据证书重点防御数据传输过程，而接口签名重点防御的是用户终端。",
    "limitation": "由于数字证书的签发机构是可信的第三方，因此数字证书的安全性严重依赖于签发机构的可信性。如果签发机构被攻击，那么攻击者就可以伪造数字证书，从而导致数字证书的安全性受到影响。此外，数字证书的安全性还受到签名算法的影响。如果签名算法被攻击，那么攻击者就可以伪造数字签名，从而导致数字证书的安全性受到影响。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0025-001": {
    "title": "邮件数字证书",
    "category": "AC01",
    "definition": "对邮件的发件人进行可信性保证，对邮件内容进行完整性和保密性保证",
    "description": "对电子邮件和附件进行数字签名和加密，为电子通信提供了高级别的机密性和安全性。加密意味着只有预期收件人才能够阅读邮件，而数字签名允许他们确认发件人，并验证邮件是否在途中被篡改。（摘自腾讯云）",
    "limitation": "使用邮件数字证书的过程可能相对繁琐，用户需要了解数字证书的概念、购买证书、配置电子邮件客户端等。这可能对一般用户造成一定的使用门槛。数字证书需要及时续期，而且在证书过期之前需要进行更新。证书管理可能变得复杂，尤其是对于大规模部署的组织。为了实现端到端的加密和签名，邮件的发送方和接收方都需要支持和配置数字证书。这意味着在一些情况下，与不使用数字证书的用户通信可能受到一些限制。邮件数字证书只能在传输过程中提供安全性，但无法解决端点安全性问题，如用户密码泄露或恶意软件感染。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0025-002": {
    "title": "HTTPS数字证书",
    "category": "AC01",
    "definition": "对HTTP请求进行可信性、完整性和保密性保证",
    "description": "通过购买并安装HTTPS证书服务，保证用户请求服务器的可信性、完整性和保密性。",
    "limitation": "HTTPS数字证书的安全性严重依赖于签发机构的可信性。如果签发机构被攻击，那么攻击者就可以伪造数字证书，从而导致HTTPS数字证书的安全性受到影响。此外，HTTPS数字证书的安全性还受到签名算法的影响。如果签名算法被攻击，那么攻击者就可以伪造数字签名，从而导致HTTPS数字证书的安全性受到影响。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0025-003": {
    "title": "文件电子印章",
    "category": "AC01",
    "definition": "对文件进行可信性和完整性签名保证",
    "description": "提供电子文件（电子合同、电子订单、电子协议等）互联网在线缔约、合同管理（历史合同、合同模板）、电子数据固证存证及实时取证等全链路管理的可信行为认证。通过保障电子数据在全生命周期内的完整、可信、不可被篡改，有效解决电子数据固证难、管理难、司法认证难的困境。（摘自jdcloud.com）",
    "limitation": "使用文件电子印章的过程可能对一般用户来说相对复杂，需要了解数字签名和印章的概念，以及如何正确地应用和验证印章。文件电子印章的可信度和有效性依赖于底层的公共密钥基础设施的可靠性。如果PKI受到攻击或存在问题，电子印章的可信度就会受到威胁。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0025-004": {
    "title": "USB Key数字证书",
    "category": "AC01",
    "definition": "一种USB接口的硬件设备。它内置单片机或智能卡芯片，有一定的存储空间，可以存储用户的私钥以及数字证书。",
    "description": "将客户端登录时所需的认证信息，（如用户名，密码，QQ，邮箱，电话，身份证号等等）均可写入到usb key内，可以写入算法，也可写入代码，从而让 key取代传统的“用户名+密码”的登录方式，实现插上Key才能登录网站或应用系统的目标。同时，开发人员还可以根据需要，设置usb key与传统的“用户名密码”方式并用的登录模式。用usb key做权限控制，设定不同的客户端拥有不同的权限。如某些客户端，只能使用网站或系统的部分功能，或不同的客户端，使用不同的网站或系统模块等，同时可以设定网站或系统使用时，是否一定要一直插着usb key或拔下usb key后多久网站或系统自动退出。",
    "limitation": "设备易于遗失或被盗，可能导致敏感信息的不当访问。依赖于登录系统的支持情况，如果系统不支持USB Key登录，那么USB Key就无法使用。",
    "references": [
      {
        "title": "USB Key - 百度百科",
        "link": "https://baike.baidu.com/item/USB%20Key/9679194?fromtitle=ukey&fromid=8352760&fr=aladdin"
      }
    ],
    "updated": "2024-01-11"
  }
}