{
  "A0034": {
    "title": "数据模糊化",
    "category": "AC01",
    "definition": "数据模糊化是一种隐私保护技术，通过对敏感数据进行变形、扰动或替换，以减轻数据泄露的风险，同时保持数据的一定可用性。其目标是在数据处理和共享过程中降低敏感信息的识别风险。",
    "description": "手段方法： 数据模糊化采用多种手段和方法，其中包括：替换和置换： 将原始数据的某些值替换为模糊或虚构的值，如将真实姓名替换为随机生成的名字。扰动： 在数据中引入噪音或扰动，使得原始数据的具体值难以被准确还原，例如在数值数据中添加随机数。泛化： 通过将数据进行泛化，将具体的细节降低为更一般化的形式，以保护隐私，例如将具体的地址泛化为城市级别。脱敏： 对数据进行脱敏处理，去除或替换其中的敏感信息，以保护隐私。数据掩码： 使用掩码技术隐藏部分数据，只展示一部分信息，以限制对敏感信息的访问。",
    "limitation": "数据模糊化虽然在隐私保护方面发挥了重要作用，但其使用也存在一些局限性。首先，模糊化可能引起信息损失，使得原始数据的精确性和细节信息受到影响，从而影响数据的分析和挖掘效果。其次，一些复杂的模糊化技术可能带来显著的性能开销，增加数据处理的计算和存储成本。此外，过度的数据模糊化可能导致数据的可用性问题，使得数据对用户或分析者的实际应用降低。最后，虽然旨在保护隐私，但部分模糊化技术仍可能受到攻击，导致数据被还原或敏感信息被推断，进一步增加了使用数据模糊化时需要谨慎权衡的因素。",
    "references": [],
    "updated": "2024-01-16"
  },
  "A0034-001": {
    "title": "数值模糊化",
    "category": "AC01",
    "definition": "将精确的数值进行一定的模糊和概算，使之与精确数值产生较大差异",
    "description": "数值模糊化的目的是为了防止攻击者通过数据分析、数据挖掘等手段来获取精确的数值。譬如很多三方机构会通过爬取商品精确销量和价格的方式来估算企业的全年营收和利润，进而在证券交易或企业并购等场景中掌握先发优势。数值模糊化的手段包括：四舍五入、取整、取余、加减乘除、随机数等。数值模糊化的应用场景包括：价格、库存、销量、评分、评论数等。",
    "limitation": "数值模糊化的目标是希望数据访问者在无法看到精确数值的前提下，能看到数据的大概趋势，但又能防御三方机构掌握自身经营态势。这种目标本身就是矛盾的，因为即便不掌握精确数据，也能根据数据的大概趋势估算出最终的经营态势。所以这种防御方案仅适合阻止三方机构掌握自身精确经营数据的场景。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0034-002": {
    "title": "数值指数化",
    "category": "AC01",
    "definition": "将精确的数值进行指数化，使之与精确数值产生较大差异",
    "description": "数值指数化是指通过一定算法将线性的数值采取非线性表达。数值指数化的目标是希望数据访问者在无法看到精确数值的前提下，能看到数据的大概趋势，但又能防御三方机构掌握自身经营态势。数值指数化的手段包括：指数化、对数化、平方、开方、立方、开立方等。",
    "limitation": "在掌握一定真实数值的前提下，通过对比生成的对应指数，是有可能还原指数化算法的。所以在指数化时，要么完全隐藏真实数值，使之不能够反推算法。要么通过一定阶梯算法将指数变成阶梯式曲线，每段阶梯的曲线算法均不一致，使得反推算法变得更困难。",
    "references": [],
    "updated": "2024-01-11"
  },
  "A0034-003": {
    "title": "响应状态模糊化",
    "category": "AC01",
    "definition": "将精确的响应状态进行模糊化，使之无法区分确切的某种状态",
    "description": "譬如很多登录系统在用户登录失败时，会提示用户用户名或密码错误，这样攻击者就可以判断一个用户在平台是否存在。将响应状态模糊化后，不管是用户不存在、还是密码错误，均提示“用户名或密码错误”，从而攻击者不再能够推断究竟是用户不存在还是密码错误。",
    "limitation": "响应状态模糊化是一种比较初级的规避手段，非常值得一试，但不是银弹",
    "references": [],
    "updated": "2024-01-16"
  }
}