{
  "R0112": {
    "title": "办公环境风险",
    "definition": "办公环境业务安全风险涉及到与业务运营相关的各种潜在威胁和危险，这可能对企业的信息、系统、员工和客户数据等方面造成危害。",
    "description": "以下是一些可能的办公环境业务安全风险场景和相关危害：数据泄露： 由于未经授权的访问、内部泄露或网络攻击，企业的敏感信息、客户数据或商业机密可能被泄露。网络攻击： 恶意软件、病毒、勒索软件、网络钓鱼等网络攻击可能导致业务系统的中断、数据损坏或数据盗窃。供应链风险： 不安全的供应链可能引入恶意软件、劣质产品或服务，对企业信息和业务流程构成威胁。社交工程： 攻击者可能通过欺骗手段获取员工敏感信息，例如通过冒充其他员工、欺诈电话或虚假电子邮件。物理安全风险： 未经授权的访问、设备丢失、不安全的设施布局等可能导致办公环境的物理安全风险。",
    "complexity": "初级",
    "influence": "影响包括：经济损失： 数据泄露、网络攻击和其他业务安全风险可能导致企业面临财务损失，包括修复成本、赔偿费用和业务中断造成的收入损失。声誉损害： 数据泄露、网络攻击等事件可能损害企业声誉，降低客户和合作伙伴的信任。法律责任： 数据泄露可能导致法律责任，公司可能面临合规罚款、诉讼和其他法律后果。业务中断： 由于网络攻击或其他安全事件引起的业务中断可能导致公司无法正常运营，影响服务交付和客户满意度。",
    "avoidances": [
      "A0017-001",
      "A0041",
      "A0051",
      "A0052",
      "A0062"
    ],
    "references": [
      {
        "title": "Physical Security - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Physical_security"
      }
    ],
    "updated": "2024-01-31"
  },
  "R0112-001": {
    "title": "自带设备办公风险",
    "definition": "自带设备办公（BYOD，Bring Your Own Device）指的是员工在工作中使用自己的个人设备（如手机、平板电脑、笔记本电脑）进行业务相关的工作。",
    "description": "自带设备办公存在多种潜在风险场景。首先，个人设备通常缺乏企业级的安全措施，可能成为安全漏洞的来源，导致敏感数据泄露。其次，合规性问题可能因难以监管个人设备而加剧，涉及的数据可能不符合法规要求。连接到企业网络的个人设备可能受到病毒和恶意软件的攻击，对整个网络安全构成威胁。企业难以有效地管理和监控各种不同类型的个人设备，从而增加了设备管理难度。最后，员工离职后仍然具有对公司数据的访问权限，可能导致数据泄露和机密信息泄露。",
    "complexity": "初级",
    "influence": "自带设备办公带来了一系列潜在的危害，包括安全漏洞、数据泄露、合规性问题、网络安全威胁、设备管理难题、失去控制权以及员工离职后的访问问题。由于个人设备的安全性无法完全受到企业控制，可能导致敏感信息在设备遗失、盗窃或被攻击时暴露，同时也增加了网络整体的风险。",
    "avoidances": [
      "A0024",
      "A0025-004",
      "A0033",
      "A0050",
      "A0043",
      "A0051",
      "A0054",
      "A0021",
      "A0037",
      "A0029-003",
      "A0060",
      "A0020-002",
      "A0041"
    ],
    "references": [
      {
        "title": "NIST SP 1800-22: Mobile Device Security: Bring Your Own Device (BYOD)",
        "link": "https://csrc.nist.gov/pubs/sp/1800/22/final"
      },
      {
        "title": "Bring Your Own Device - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Bring_your_own_device"
      }
    ],
    "updated": "2024-01-29"
  },
  "R0112-002": {
    "title": "未授权物理访问",
    "definition": "未经授权的物理访问是指未经公司或组织明确批准的情况下，个体或实体进入办公场所、设备区域、数据中心或其他敏感场所的行为。",
    "description": "这种物理访问可能导致潜在的信息安全威胁和风险，涉及以下方面：未授权人员进入办公区域： 攻击者可能冒充员工、访客或承包商，通过社交工程、假冒身份或其他欺骗手段，绕过安保措施，进入公司的办公区域。访客管理不善： 公司未能有效管理访客进入，缺乏必要的访客登记程序和身份验证措施，可能导致未经授权的人员进入公司区域。未经授权的设备连接： 未经授权的员工或访客可能尝试连接其个人设备到公司网络，可能引入恶意软件、间谍软件或其他安全威胁。物理文件和设备访问： 未授权的个体可能访问、复制或窃取办公区域内的物理文件、电脑或其他设备，导致敏感信息的泄露。未经授权的数据中心访问： 对数据中心的未经授权访问可能导致对服务器、存储设备和网络设备的非法操作，从而引发数据泄露或系统破坏。未经授权的机房访问： 企业的机房通常包含关键的IT设备，未经授权的人员进入可能导致设备的非法访问、破坏或数据泄露。",
    "complexity": "初级",
    "influence": "未经授权的物理访问可能带来严重的信息安全危害。攻击者通过冒充员工、访客或承包商的身份，进入办公场所、数据中心或机房，有可能导致机密信息的窃取、篡改或破坏。这种不当的访问行为可能引发数据泄露，使公司业务受到严重损害，同时也可能导致声誉损失、法律责任和财务损失。另外，未经授权的访问可能使恶意软件或恶意设备进入公司网络，为后续攻击铺平道路。",
    "avoidances": [
      "A0017",
      "A0017-001",
      "A0020-002",
      "A0023-001",
      "A0024",
      "A0041",
      "A0051",
      "A0052",
      "A0059",
      "A0062"
    ],
    "references": [
      {
        "title": "Physical Security - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Physical_security"
      }
    ],
    "updated": "2024-01-30"
  },
  "R0112-003": {
    "title": "未授权设备接入",
    "definition": "企业未授权设备接入风险指的是未经批准或未被授权的设备（包括计算机、移动设备、网络设备等）连接到企业网络或系统中，可能导致安全威胁和数据泄露。这些设备可能是员工自带的个人设备、未经授权的硬件、或者恶意设备，它们进入企业网络后可能对信息安全和网络稳定性构成威胁。",
    "description": "以下是一些可能的未授权设备接入的场景和危害：员工带入个人设备： 员工可能将自己的个人电脑、平板电脑或手机连接到企业网络，而未经授权或未采取必要的安全措施。未授权的硬件： 外部人员或供应商可能携带未经授权的硬件设备，试图将其连接到企业网络，以执行未经授权的操作。未经授权的网络设备： 未经授权的网络设备（如路由器、交换机）可能被连接到企业网络，改变网络拓扑或执行潜在的恶意操作。恶意设备： 攻击者可能尝试将恶意设备（如恶意USB设备或网络嗅探器）连接到企业网络，以执行攻击、窃取信息或横向移动。",
    "complexity": "初级",
    "influence": "危害包括：安全威胁： 未授权设备可能引入病毒、恶意软件或其他安全威胁，对企业网络和系统造成危害。数据泄露： 未经授权的设备可能访问、存储或传输敏感信息，导致数据泄露的风险。",
    "avoidances": [
      "A0017-001",
      "A0020-002",
      "A0041",
      "A0051",
      "A0052",
      "A0057",
      "A0062"
    ],
    "references": [
      {
        "title": "Physical Security - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Physical_security"
      }
    ],
    "updated": "2024-01-29"
  },
  "R0112-004": {
    "title": "物理损害与破坏",
    "definition": "企业物理损害与破坏风险指的是企业在物理层面面临的潜在威胁，这可能导致公司设施、财产或基础设施的损害或破坏。这些风险可能来自多种因素，包括自然灾害、人为破坏、盗窃、恐怖袭击等。",
    "description": "以下是一些可能的场景和危害：自然灾害： 地震、火灾、洪水、飓风等自然灾害可能导致企业设施的严重损坏。人为破坏： 恶意破坏、蓄意纵火、破坏性抢劫等行为可能导致企业财产和设备的损害。盗窃和入侵： 盗贼或未经授权的人员可能尝试进入企业设施，盗窃财产或者对设施进行破坏。恐怖袭击： 恐怖分子可能对企业进行恐怖袭击，导致人员伤亡、设施破坏以及运营中断。工业事故： 事故，如火灾、爆炸或泄漏，可能导致企业设施的损坏，同时对员工和周围环境构成威胁。",
    "complexity": "初级",
    "influence": "可能导致：经济损失： 物理损害和破坏会导致企业面临昂贵的修复成本，同时可能导致业务中断，进而引起经济损失。业务中断： 设施的物理损害可能导致业务中断，影响生产和服务提供，损害企业的运营能力。声誉损害： 物理损害和破坏事件可能对企业的声誉造成负面影响，尤其是在公众和客户中。员工安全风险： 物理损害可能威胁员工的安全，导致伤亡或健康问题。",
    "avoidances": [
      "A0017-001",
      "A0051",
      "A0052",
      "A0058",
      "A0062"
    ],
    "references": [
      {
        "title": "Sabotage - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Sabotage"
      }
    ],
    "updated": "2024-01-29"
  },
  "R0112-005": {
    "title": "监控与窃听",
    "definition": "指的是在企业环境中，由于监控设备或窃听工具的存在，可能导致机密信息泄露、隐私侵犯以及其他潜在的安全问题。这些风险可能来自内部或外部的威胁，包括员工、竞争对手、供应商或其他不法行为的个体或组织。",
    "description": "一些可能的监控与窃听风险场景包括：非法窃听设备： 不法分子可能在企业办公室、会议室或其他敏感区域安装窃听设备，以监听敏感信息的对话或会议。监控摄像头滥用： 公司内部或外部的监控摄像头可能被滥用，用于监视员工或公司内部的活动，侵犯员工的隐私权。电子窃听： 攻击者可能通过远程访问企业通信设备，如电话线路或VoIP系统，进行窃听敏感通信。内部员工泄密： 内部员工可能通过携带录音设备、拍照设备或其他窃听工具，将机密信息记录下来，并泄露给竞争对手或其他恶意方。供应链风险： 在供应链中的第三方供应商或服务提供商可能被黑客攻击，导致窃听设备被引入企业网络或物理环境。",
    "complexity": "初级",
    "influence": "监控与窃听风险的危害包括但不限于：信息泄露： 监听敏感信息或通信可能导致公司的商业机密、策略和其他重要信息泄露。隐私侵犯： 员工或管理层的隐私权可能受到侵犯，特别是在工作场所或企业活动中。声誉损害： 一旦监控或窃听行为曝光，公司的声誉可能受到损害，影响客户和合作伙伴的信任。",
    "avoidances": [
      "A0017-001",
      "A0041",
      "A0044",
      "A0051",
      "A0052",
      "A0062"
    ],
    "references": [
      {
        "title": "Eavesdropping - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Eavesdropping"
      }
    ],
    "updated": "2024-01-29"
  },
  "R0112-006": {
    "title": "无线网络风险",
    "definition": "无线网络风险指的是在使用无线网络（Wi-Fi）时可能面临的潜在威胁和安全问题。由于无线网络的特性，例如信号广播、无线传输，使其更容易受到不同类型的攻击。",
    "description": "以下是一些常见的无线网络风险：未经授权访问： 未经授权的个体可能尝试访问受保护的无线网络，获取网络中的敏感信息或进行其他恶意活动。密码破解： 攻击者可能试图破解无线网络的密码，以获取网络访问权限。弱密码、默认密码或使用不安全的加密算法都可能增加密码被破解的风险。钓鱼攻击： 攻击者可以设置虚假的无线网络，模拟合法网络的名称，引导用户连接并窃取其敏感信息，这被称为钓鱼攻击。中间人攻击： 攻击者可能尝试在用户和访问点之间插入自己，监视或篡改通信流量。这种攻击被称为中间人攻击，可以导致信息泄露和数据篡改。无线干扰： 恶意设备或无意的无线设备可能引起网络干扰，影响正常的通信和连接质量。无线克隆： 攻击者可能克隆合法的无线访问点，使用户连接到恶意的克隆点，从而暴露于安全风险。无线入侵： 攻击者可能试图入侵无线网络的受保护系统，以获取对网络基础设施和关键信息的访问权限。",
    "complexity": "初级",
    "influence": "",
    "avoidances": [
      "A0017",
      "A0017-001",
      "A0018",
      "A0051",
      "A0052"
    ],
    "references": [
      {
        "title": "Wireless Security - Wikipedia",
        "link": "https://en.wikipedia.org/wiki/Wireless_security"
      }
    ],
    "updated": "2024-01-29"
  }
}