{
  "R0005": {
    "title": "Promotional Activity Cheating",
    "definition": "Using large numbers of accounts to complete platform promotional activities for profit.",
    "description": "After obtaining a large number of platform accounts, automatically completing platform promotional activities (including check-ins, tasks, red packet grabbing, coupon collection, flash sales, group buying, etc.). Account sources typically include bulk registration by black market operators (R0030), credential stuffing (R0032-001), credential cracking (R0032), or purchasing from black markets. Completing activities requires process automation capabilities (R0001).",
    "complexity": "Intermediate",
    "influence": "Exploits platform promotional benefits and prevents legitimate users from participating in activities.",
    "references": [
      {
        "title": "What Does Promotional Activity Cheating Mean?",
        "link": "https://zhidao.baidu.com/question/1389943897887283500.html"
      }
    ]
  },
  "R0005-001": {
    "title": "Bulk Fake Account Manipulation",
    "definition": "Using large numbers of accounts to perform likes, favorites, shares, comments, etc. to influence platform ranking metrics and profit.",
    "description": "After obtaining a large number of platform accounts, automatically performing likes, favorites, shares, comments, and other functions to influence platform ranking metrics, enabling unfair competition and profit. Account sources typically include bulk registration (R0030), credential stuffing (R0032-001), credential cracking (R0032), or purchasing from black markets. Requires process automation capabilities (R0001).",
    "complexity": "Advanced",
    "influence": "Enables unfair competition through inflated positive ratings.",
    "references": [
      {
        "title": "What Is the Purpose of Fake Followers? How to Remove Fake Followers?",
        "link": "https://dun.163.com/news/p/840c5640093140fbad7ed1cfe30f547b"
      }
    ]
  },
  "R0005-002": {
    "title": "Fake Viral Referral",
    "definition": "Using large numbers of accounts to complete referral/viral growth activities for profit.",
    "description": "Also called 'new user acquisition cheating'. After obtaining a large number of platform accounts, automatically completing referral and recommendation tasks for profit. Account sources typically include bulk registration (R0030). Requires process automation capabilities (R0001).",
    "complexity": "Advanced",
    "influence": "Exploits platform promotional benefits.",
    "references": [
      {
        "title": "Viral Growth Tactics May Seem Varied, But There Is Only One Core Element",
        "link": "https://zhuanlan.zhihu.com/p/110531852"
      },
      {
        "title": "Running a Viral Marketing Campaign? Don't Overlook the Anti-Cheating Component",
        "link": "https://ishare.ifeng.com/c/s/v002ZjHiClSab6wTq1twdmiKvHULvXFzqSujP--nz2AHj820__"
      }
    ]
  }
}
